Repository: volard/mcs_calculator
Catalog: lib/l10n/intl_*.arb
Languages: ru

# avgPendingTime
source: Average pending time
ru: Среднее время ожидания

source: Channels quantity
ru: Количество каналов

source: Load factor
ru: Коэфициент загрузки системы

# inputStreamIntensity
source: Input stream factor
ru: Интенсивность входного потока

source: Pending capacity
ru: Число мест ожидания

source: Queue length
ru: Длина очереди

source: Queue
ru: Очередь

source: Requests quantity
ru: Количество заявок

source: Service time
ru: Время обслуживания

source: State probability
ru: Вероятность состояния

# stateProbabilities
source: States probabilities
ru: Вероятности состояний

# appName
source: MSC calculator
ru: Калькулятор ВС

# noInputErrorLabelText
source: Please input value
ru: Введите значение

# inputStreamIntensityDescription
source: Quantity of incoming requests per unit time
ru: Количество поступающих заявок в единицу времени

# serviceTimeDescription
source: Also known as service intensity. It's quantity of time needed to proceed one incoming request
ru: Также известный, как интенсивность обслуживания. Это количество времени, необходимое для обработки одной входящей заявки

# channelsQuantityDescription
source: Quantity of channels (or maintenance devices in other words) proceeding incoming requests
ru: Количество каналов (или обслуживающих устройств) обрабатывающих входящие заявки

# pendingCapacityDescription
source: Also known as buffer size. It's quantity of requests that can stay in system waiting for proceeding. Imagine it like amount of people that waiting their turn in a cashier queue in a store for example
ru: Известный также, как размер буфера или число мест ожидания. Это количество заявок, которые могут оставаться в системе, ожидая их очереди на обработку. Представьте это, как количество человек, которые могут стоять в очереди на кассу, например

# loadFactorDescription
source: <p> $$\rho = \frac{\lambda}{m \mu } $$ where <br> \(m\) - channels quantity <br> \(\mu\) - service time </p>
ru: <p> $$\rho = \frac{\lambda}{m \mu}$$ where <br> \(m\) - количество каналов <br> \(\mu\) - время обслуживания </p>

source: Absolute throughput
ru: Абсолютная пропускная способность

source: Relative throughput
ru: Относительная пропускная способность

source: Where
ru: Где

source: reject
ru: отказ

source: Constant
ru: Константа

source: Finite
ru: Конечна

source: Infinite
ru: Бесконечна

# pZeroDescription
source: Probability indicating that system is in zero state
ru: Вероятность того, что система находится в нулевом состоянии

# PnmDescription
source: Probability indicating that system is in state of n+m. In other words, its when all system's maintenance devices (or channels = n) are busy and buffer size (or pending capacity = m) is filled out, so any new request will be immediately rejected
ru: Вероятность того, что система находится в n+m состоянии. Другими словами, это когда все обслуживающие устройства (или каналы = n) заняты и длина очереди (или число мест ожидания = m) заполнена, поэтому любая новая заявка будет сразу отклонена

source: request rejection probability
ru: вероятность отказа заявки

# avgPendingTimeDescription
source: <p> $$ \overline{\\W} = \frac{\\L}{\\A} $$ where <br> \(L\) - queue length <br> \(A\) - absolute throughput $$ A = \lambda Q $$ <br> where \(Q\) - relative throughput $$ Q = 1 - P_{\\reject} $$ where <br> \(P_{\\reject}\) - probability of request rejection $$ P_{\\reject} = \left[ \begin{\\array}{\\cl} 0 &, \ k = \infty \end{\\array} \right. $$ </p>
ru: <p> $$\overline'{'W'}' = \frac'{'L'}''{'A'}'$$ where <br> \(L\) - queue length <br> \(A\) - absolute throughput $$ A = \lambda Q $$ <br> where \(Q\) - relative throughput $$ Q = 1 - P_{\\reject} $$ </p>
